<html>
    <head>
    <body>
        <h1> UNIDAD 2</h1>
        <ul>
            <li><a href="../index.html">INICIO</a></li>
            <li> <a href = "../paginas/UNIDAD 1 .html">UNIDAD 1</a></li>
            <li> <a href = "#">UNIDAD 2</a></li>
            <li> <a href = "../paginas/UNIDAD 3.html">UNIDAD 3</a></li>
            <li> <a href = "../paginas/UNIDAD 4.html">UNIDAD 4</a></li>
         </ul>
         <p>inicio de la unidad 2.</p>
    </body>    
    </head>
    <subtitle><center><b>Arquitectura de Computadoras</b></center></subtitle>
    <subtitle><center><b>Unidad Central de Procesamiento</b></center></subtitle>
    <p>Los CPUs modernos pueden clasificarse de acuerdo a varias
        caracter&iacute;sticas, tales como:</p>
        <ul>
            <li>Tama&ntilde;o de la Unidad Aritm&eacute;tica L&oacute;gica (ALU).</li>
            <li>Bus de conexi&oacute;n al exterior (8, 16, 32, 64 bits)</li>
            <li>Si su arquitectura tiene cauce (pipeline).</li>
            <li>Si son de arquitectura CISC o RISC.</li>
            <li>Si son Von Newmann o Harvard.</li>
            <li>Si manejan instrucciones enteras o implementan tambi&eacute;n instrucciones de punto flotante.</li>
        </ul>
        <subtitle><center><b>Caracteristicas</b></center></subtitle>
    <p>Las caracter&iacute;sticas m&aacute;s importantes a considerar al escoger
        un CPU en una aplicaci&oacute;n, son:
        Modelo del programador (Conjunto de registros que el
        programador puede utilizar), forman el modelo mental del
        CPU que el programador utiliza al programar en
        ensamblador.
        
        Conjunto de instrucciones que puede ejecutar el CPU.
        Los modos de direccionamiento que pueden usarse para
        obtener los operandos de las instrucciones.
        
        Ciclo de instrucci&oacute;n (el conjunto de pasos que realiza el CPU
        para procesar cada instrucci&oacute;n)
        Buses de interconexi&oacute;n, usados para que el CPU lea y
        escriba a la memoria.</p>
        <subtitle><center><b>Dispositivos de entrada y salida.</b></center></subtitle>
        <subtitle><b>Como podemos clasificarlos:</b></subtitle> 
    <p>No hace mucho tiempo, el procesador era algo totalmente
        desconocido por los usuarios de PCs.
        Esto fue cambiando con el tiempo y en la actualidad
        cualquier persona al comprar un equipo se pregunta acerca
        de los atributos elementales de este dispositivo.
        Es que el procesador es una parte esencial de la
        computadora, por eso generalmente se la conoce como su
        <i>cerebro</i>.
        Para la selecci&oacute;n de los procesadores a utilizar en los equipos
        necesitamos ver las acciones tales como:</p>  
        <ul>
            <li>Acciones Directas.</li>
            <li>Integrar un nuevo sistema de c&oacute;mputo.</li>
            <li>Reemplazar un CPU da&ntilde;ado.</li>
            <li> Actualizar un sistema de c&oacute;mputo.</li>
            <li> Acciones Indirectas.</li>
            <li>Comprar equipo de c&oacute;mputo nuevo.</li>
            <li>Construir un equipo de control/Microcontrolador</li>
        </ul>      
    <p>En el caso de los CPU  de Intel ,las caracter&iacute;sticas y los
        beneficios de las tecnolog&iacute;as Intel dependen de la
        configuraci&oacute;n del sistema y podr&iacute;an requerir hardware y
        software habilitados o la activaci&oacute;n de servicios.
        El desempe&ntilde;o var&iacute;a seg&uacute;n la configuraci&oacute;n del sistema.
        Ning&uacute;n sistema inform&aacute;tico puede ser absolutamente seguro.
        <subtitulo><b>Procesadores Intel</b></subtitulo>
        Lo primero a definir es qu&iacute; necesidades se tienen.
        Si la movilidad o la falta de espacio son elementos claves a
        considerar se optar&aacute; por una computadora port&aacute;til, o laptop.
        Intel ofrece para estos dispositivos diferentes familias de
        procesadores seg&uacute;n los requerimientos de cada usuario.
        Los procesadores para port&aacute;tiles calificados con 5 estrellas
        satisfacen la m&aacute;xima exigencia m&oacute;vil.
        Si eres un gamer necesitas un equipo muy potente, los
        procesadores que permiten ejecutar varias aplicaciones
        simult&aacute;neamente, con la posibilidad de vivir los juegos con
        mucho realismo y excelente performance gr&aacute;fica.</p>
        <center><img src="img /intel.jpeg" alt=""></center>
    
    <p>La inteligencia artificial est&aacute; cambiando nuestras
        expectativas de lo que pueden hacer los productos de
        tecnolog&iacute;a para nosotros. Y ahora, est&aacute; transformando
        la PC que conocemos y de la que dependemos para
        nuestro trabajo m&aacute;s importante y nuestros proyectos
        creativos.
        Intel ha integrado capacidades de IA al procesador de
        la PC para satisfacer la creciente demanda de
        aplicaciones de software modernas. Ya sea que se
        trate de aplicaciones existentes que se vuelven m&aacute;s
        
        inteligentes o de herramientas totalmente nuevas, las
        PCs inteligentes m&aacute;s recientes te ofrecen un
        desempe&ntilde;o dedicado para redes neuronales profundas
        que constituyen la base de las aplicaciones de IA.
        Los procesadores Intel CoreTM de 11ra Generaci&oacute;n,
        basados en las capacidades revolucionarias de la
        generaci&oacute;n anterior, siguen forzando los l&iacute;mites del
        generan anterior, siguen forzando los l&iacute;mites del
        desempe&ntilde;o con una velocidad e inteligencia incre&iacute;bles.
        Tambi&eacute;n tendr&aacute;s experiencias de colaboraci&oacute;n m&aacute;s
        inmersivas, que incluyen supresi&oacute;n de ruido neuronal,
        difuminado de fondo, s&uacute;per resoluci&oacute;n de video y el
        c&oacute;dec de video m&aacute;s reciente, todo ello con una laptop
        delgada y liviana.</p>    

        <subtitle><center><b>Publicidad AMD</b></center></subtitle>
        <center><img src="img /AMD.jpeg" alt=""></center> 
    <p>Jerga inteligente: para entender los semiconductores
        <ul>
        <li><b> Unidad de procesamiento central (CPU):</b>circuito
            de control principal de una computadora que realiza
            operaciones aritm&eacute;ticas, l&oacute;gicas, de control, y de
            entrada y salida (E/S).
        </li>
        <li><b>Chiplet:</b>circuito integrado (CI) que contiene un
            subconjunto de los bloques funcionales que
            generalmente son necesarios para un sistema en
            chip (SOC) completo.
        </li>
        <li><b>Chip:</b>peque&ntilde;o bloque de material semiconductor en
            el que se coloca un CI funcional espec&iacute;fico.
        </li>
        <li><b>Modelo comercial integrado:</b>modelo comercial
            l&iacute;der en el sector de los semiconductores que permite
            a las empresas destinar m&aacute;s ganancias para
            investigaci&oacute;n y desarrollo, y estrategias de
            crecimiento.
        </li>
        <li><b>Unidad de procesamiento de gr&aacute;ficos (GPU):</b>circuitos que 
            realizan operaciones de
            grandes cantidades de datos en simult&aacute;neo para
            crear im&aacute;genes en una pantalla o c&aacute;lculos no
            gr&aacute;ficos, como an&aacute;lisis de aprendizaje autom&aacute;tico.
        </li>
        <li><b>Circuito integrado (CI):</b>conjunto de circuitos
            electr&oacute;nicos dise&ntilde;ados en un &aacute;rea peque&ntilde;a del
            material semiconductor (por ej., el silicio).
        </li>
        <li><b>Nan&oacute;metro (nm):</b> unidad de medida (la mil
            millon&eacute;sima parte de un metro); se utiliza para
            definir el tama&ntilde;o de elemento m&iacute;nimo de una
            tecnolog&iacute;a de procesos</li>
        <li><b> de equipos originales
            (OEM):</b> empresa que monta o produce dispositivos
            de usuario final terminados que est&aacute;n destinados a la
            promoci&oacute;n o la venta, ya sea propia o a trav&eacute;s de terceros.</li>
        <li><b>Paquete:</b> carcasa de metal, pl&aacute;stico, cristal o
            cer&aacute;mica que contiene uno o m&aacute;s CI independientes.</li>
        <li><b>Tecnolog&iacute;a de procesos:</b> las normas de dise&ntilde;o y el
            proceso de producci&oacute;n espec&iacute;ficos de un  semiconductor;
            tambi&eacute;n llamada nodo de tecnolog&iacute;a, 
            nodo de proceso o simplemente nodo.</li> 
        <li><b>Sistema en chip (SOC):</b> CI que combina muchos
            componentes de una computadora u otro sistema
            electr&oacute;nico en un mismo chip.</li>    
        <li><b>Transistor:</b> componente que regula el flujo de
            corriente el&eacute;ctrica y funciona como componente
            fundamental de los CI.</li>    
        <li><b>Oblea:</b> l&aacute;mina fina de silicio que se utiliza para
            fabricar varios CI.</li>

        <b> Un solo tel&eacute;fono inteligente de hoy tiene mucha
            m&aacute;s potencia de procesamiento que las
            computadoras que utiliz&oacute; la NASA en 1969 para
            llevar el Apollo 11 a la luna.</b>  
    <p>AMD es la primera empresa en lanzar CPU y GPU x86
        de 7nm en el mercado. Estos dispositivos ya se
        utilizan en los centros de datos y productos para
        consumidores (por ej., computadoras port&aacute;tiles y de
        escritorio) de hoy.
        Con los tiempos de ejecucion extremadamente
        extensos que requieren las nuevas tecnologias de
        procesos, los ingenieros de AMD ya est&aacute;n trabajando
        en innovaciones que quiz&aacute;s, alg&uacute;n d&iacute;a, permitan crear
        CI con procesos de 5nm y 3nm.
        Otro enfoque clave para mejorar el rendimiento de los
        procesadores es la implementacion de un dise&ntilde;o
        particionado de varios chips, que permite que una
        empresa de semiconductores interconecte muchas
        placas de n&uacute;cleos m&aacute;s peque&ntilde;as y compactas para
        fabricar una CPU con muchos m&aacute;s n&uacute;cleos. Por
        ejemplo, la segunda generaci&oacute;n de los procesadores
        para servidores AMD EPYCTM divide un chip para
        servidores de 32 nucleos con arquitectura monolitica
        en ocho <i>chiplets</i> independientes de 7nm que van
        combinados en un m&oacute;dulo de varios chips y se
        conectan mediante seales de alta velocidad. La
        fabricaci&oacute;n de este procesador EPYCTM como un &uacute;nico
        chip no habr&iacute;a sido posible con las limitaciones (limite
        de reticula) del equipo de fabricaci&oacute;n. El dise&ntilde;o
        tambien puede llegar a mejorar el rendimiento de
        productos aceptables en producci&oacute;n. AMD estima que
        la t&eacute;cnica de varios chips reduce los costos de
        producci&oacute;n en aproximadamente un 40%.
        El poder y la libertad para llegar m&aacute;s lejos
        Ya sea para agilizar el descubrimiento de farmacos o
        realizar una compra en linea, los procesadores de
        semiconductores permiten tomar una amplia variedad
        de decisiones basadas en datos. A lo largo de m&aacute;s de
        50 a&ntilde;os, AMD ha innovado constantemente en la
        computaci&oacute;n de alto rendimiento, los graficos y las
        tecnologias de visualizaci&oacute;n."</p>   
        
        
        <center><b><h3>Arquitectura Segmentada.</h3></b></center>

   Es una de las tecnologias utilizadas para realizar la
   segmentaci&oacute;n o paralelismo. Divide el procesador, en etapas,
   procesa una instrucci&oacute;n diferente en cada una y trabaja con
   varias a la vez.
   Pueden trabajar de forma paralela, en diferentes
   instrucciones, utilizando una cola de instrucciones para su
   comunicaci&oacute;n, denominado entubamiento.
   La dependencia de datos y de control, que tiene como efecto
   la disminuci&oacute;n del rendimiento del pipelining.

   La segmentaci&oacute;n de cauce (pipelining) es una forma efectiva
   de organizar el hardware del CPU para realizar m&aacute;s de una
operaci&oacute;n al mismo tiempo.
Consiste en descomponer el proceso de ejecuci&oacute;n de las
instrucciones en fases o etapas que permitan una ejecuci&oacute;n
simultanea.
Explota el paralelismo entre las instrucciones de un flujo
secuencial.

La segmentaci&oacute;n es una t&eacute;cnica de implementación por la
cual se solapa la ejecuci&oacute;n de m&uacute;ltiples instrucciones.
La tecnica de implementaci&oacute;n clave utilizada para hacer
CPU rapidas.
La segmentación es como una linea de ensamblaje: cada
etapa de la segmentaci&oacute;n completa una parte de la
instrucci&oacute;n.

Como en una l&iacute;nea de ensamblaje, la acci&oacute;n a realizar en una
instrucci&oacute;n se descompone en partes más peque&ntilde;as, cada una
de las cuales necesita una fracci&oacute;n del tiempo necesario para
completar la instrucci&oacute;n completa.
Cada uno de estos pasos se define como etapa de la
   segmentaci&oacute;n o segmento.
   Las etapas est&aacute;n conectadas, cada una a la siguiente, para
   formar una especie de cauce las instrucciones se entran por
   un extremo, son procesadas a trav&eacute;s de las etapas y salen por
   el otro.
   La productividad de la segmentaci&oacute;n esta determinada por la
   frecuencia con que una instrucci&oacute;n salga del cauce.
   Como las etapas est&aacute;n conectadas entre s&aacute;, todas las etapas
   deben estar listas para proceder al mismo tiempo. El tiempo
   requerido para desplazar una instrucci&eacute;n;, un paso, a lo largo
   del cauce es un ciclo m&aacute;quina.
   La duraci&oacute;n de un ciclo máquina est&aacute; determinada por el
   tiempo que necesita la etapa m&aacute;s lenta (porque todas las
   etapas progresan a la vez).
   Con frecuencia, el ciclo m&aacute;quina es un ciclo de reloj (a veces
   dos, o raramente m&aacute;s), aunque el reloj puede tener m&uacute;ltiples fases.
   La mejora de velocidad debida a la segmentaci&oacute;n es igual al
   número de etapas.
   La segmentaci&oacute;n consigue una reducci&oacute;n en el tiempo de
   ejecuci&oacute;n medio por instrucci&oacute;n.
   Esta reducci&oacute;n se puede obtener decrementando la duraci&oacute;n
   del ciclo de reloj de la m&aacute;quina segmentada o disminuyendo
   el n&uacute;mero de ciclos de reloj por instrucci&oacute;n, o haciendo
   ambas cosas.
   El mayor impacto está en el n&uacute;mero de ciclos de reloj por
   instrucci&oacute;n, aunque el ciclo de reloj es, con frecuencia, m&aacute;s
   corto en una m&aacute;quina segmentada (especialmente en
   supercomputadores segmentados).
     La segmentaci&oacute;n es una técnica de implementaci&oacute;n, que
   explota el paralelismo entre las instrucciones de un flujo
   secuencial. Tiene la ventaja sustancial que, de forma distinta
   a algunas t&eacute;cnicas de aumento de velocidad, no es visible al
   programador.
   <center><img src="img /imagen4.jpeg" alt=""></center> 
<ul>
    <i><b>Tipos de cauces:</b></i>
    <li><b>Unifunci&oacute;n:</b>ejecutan un &uacute;nico proceso. </li>
    <li><b>Multifunci&oacute;n</b> pueden ejecutar varios procesos.</li>
    <li><b>Est&aacute;ticos:</b> en un instante determinado solo pueden ejecutar uno</li>
    <li><b>Din&aacute;micos:</b> pueden ejecutar simult&aacute;neamente varios
        procesos.</li>
    <li><b>Lineal:</b>a cada etapa s&oacute;lo le puede seguir otra etapa concreta.</li>
    <li><b>No Lineal:</b>se pueden establecer recorridos complejos de
        las etapas.</li>
    <center><h2>Ciclos de Instruccion.
        Ejecución de instrucciones en 5 ciclos</h2></center>
        
        <b>Etapas de cauce.</b>
        <center><img src="img /imagen5.jpeg" alt=""></center> 
    Donde:    
    <li><b>IF:</b>Busqueda de una instrucci&oacute;n de la memoria.</li>
    <li><b>ID:</b>Busqueda de registros y decodificaci&oacute;n de instrucciones</li>
    <li><b>EXE:</b>Ejecuci&oacute;n o c&aacute;lculo de direcci&oacute;n</li>
    <li><b>MEM:</b>Acceso a la memoria de datos.</li>
    <li><b>WB:</b>Escribir datos en el archivo de registros</li>
    <center><img src="img /imagen6.jpeg" alt=""></center>
    La segmentaci&oacute;n ayuda en la realizaci&oacute;n de una carga de
trabajo.
Realiza m&uacute;ltiples tareas simult&aacute;neamente utilizando
diferentes recursos.
La velocidad se incrementa si se aumenta el numero de
segmentos.

La raz&oacute;n de segmentaci&oacute;n est&aacute; dada por el segmento m&aacute;s
lento.
El tiempo en llenar y vaciar los segmentos reduce la
velocidad.
Dedica unidades especificas del procesador a cada una de las
partes del ciclo de instrucci&oacute;n y ejecutarlas paralelamente.
Mejora dramaticamente el rendimiento debido a que en los
procesadores tienen etapas en el ciclo de instrucci&oacute;n.
La unidad de control se subdivide en dos o más unidades
funcionales, cada una encargada de llevar a cabo una parte
del ciclo de instrucci&oacute;n.
Se comunican a trav&eacute;s de una cola de instrucciones
(Pipeline).


</ul>   
    </ul>    
    <subtitle><b>BUSES</b></subtitle>
    <p>Existen dos tipos primordiales de buses (conexiones) para el
        env&iacute;o de la informaci&oacute;n: bus paralelo o serial.
        Hay diferencias en el desempe&ntilde;o y hasta hace unos a&ntilde;os se
        consideraba que el uso apropiado depend&iacute;a de la longitud
        f&iacute;sica de la conexi&oacute;n: para cortas distancias el bus paralelo,
        para largas el serial.
        Bus paralelo: Es un bus en el cual los datos son enviados por
        bytes al mismo tiempo, con la ayuda de varias l&iacute;neas que
        tienen funciones fijas. La cantidad de datos enviada es
        bastante grande con una frecuencia moderada y es igual al
        ancho de los datos por la frecuencia de funcionamiento. En
        los computadores ha sido usado de manera intensiva, desde
        el bus del procesador, los buses de discos duros, tarjetas de
        expansi&oacute;n y de v&iacute;deo hasta las impresoras.
        
        Bus serie: En este los datos son enviados, bit a bit y se
        reconstruyen por medio de registros o rutinas de software.
        Est&aacute; formado por pocos conductores y su ancho de banda
        depende de la frecuencia. Es usado desde hace menos de 10
        a&ntilde;os en buses para discos duros, tarjetas de expansi&oacute;n y para
        el bus del procesador.
        
        <li><b>Buses del procesadror</b>
        Bus de Direcciones: Es unidireccional debido a que la
        informaci&oacute;n fluye es una solo sentido, del CPU a la memoria
        &oacute; a los elementos de entrada y salida.
        El CPU puede colocar niveles l&oacute;gicos en las n l&iacute;neas de
        direcci&oacute;n, con la cual se genera 2n posibles direcciones
        diferentes. Cada una de estas direcciones corresponde a una
        localidad de la memoria &oacute; dispositivo de E / S.
        El procesador env&iacute;a un c&oacute;digo de direcci&oacute;n a la memoria o a
        otro dispositivo externo. El tama&ntilde;o o anchura del bus de
        direcciones est&aacute; especificado por el n&uacute;mero de hilos
        conductores o pines.
        Bus de Datos: Es bidireccional, pues los datos pueden fluir
        hacia &oacute; desde el CPU.Las terminales pueden ser entradas &oacute;
        salidas, seg&uacute;n la operaci&oacute;n que se este realizando ( lectura &oacute;
        escritura ).En todos los casos, las palabras de datos
        transmitidas tiene m bits de longitud debido a que el CPU
        maneja palabras de datos de m bits; del n&uacute;mero de bits del
        bus de datos, depende la clasificaci&oacute;n del procesador.En
        algunos procesadores, el bus de datos se usa para transmitir
        otra informaci&oacute;n adem&aacute;s de los datos.Es compartido en el
        tiempo &oacute; multiplexado. Transfieren datos o c&oacute;digos de
        instrucci&oacute;n hacia el procesador o se env&iacute;an hacia el exterior
        los resultados de las operaciones o c&aacute;lculos.</p></li>
<body>
<li><b>Bus de Control:</b> Este conjunto de se&ntilde;ales se usa para
    sincronizar las actividades y transacciones con los
    perif&eacute;ricos del sistema. Algunas de estas se&ntilde;ales, como
    Lectura o Escritura R / W , son se&ntilde;ales que el CPU env&iacute;a
    para indicar que tipo de operaci&oacute;n se espera en ese momento.
    Los perif&eacute;ricos tambi&eacute;n pueden remitir se&ntilde;ales de control al
    CPU, como son INT, RESET, BUS RQ.
    Las se&ntilde;ales m&aacute;s importantes en el bus de control son las
    se&ntilde;ales de cron&oacute;metro, que generan los intervalos de tiempo
    durante los cuales se realizan las operaciones. Este tipo de
    se&ntilde;ales depende directamente del tipo del microprocesador.
    El procesador para coordinar sus operaciones y para
    comunicarse con los dispositivos externos. El bus de control
    dispone de se&ntilde;ales que permiten leer y escribir datos en
    memoria o realizar una operación de Entrada/Salida en el
    instante adecuado.</li>

<li><b>Tecnolog&iacute;a de buses.</b>
    Un bus se puede definir como una l&iacute;nea de interconexi&oacute;n
    portadora de informaci&oacute;n, constituida por varios hilos
    conductores (en sentido f&iacute;sico) o varios canales (en sentido
    de la l&oacute;gica), por cada una de las cuales se transporta un bit
    de informaci&oacute;n. El n&uacute;mero de l&iacute;neas que forman los buses
    (ancho del bus) es fundamental: Si un bus est&aacute; compuesto
    por 16 l&iacute;neas, podr&aacute; enviar 16 bits al mismo tiempo.
    Los buses conectan toda la circuiter&iacute;a interna. Es decir, los
    distintos subsistemas del ordenador intercambian datos
    gracias a los buses. </li>
<p>

</p>
<center><h3>Podemos clasificar a los buses, seg&uacute;n el
    criterio de su situaci&oacute;n f&iacute;sica:</h3></center>
<p>

</p>
<li><b>Bus Interno:</b> Este mueve datos entre los componentes
    internos del microprocesador.</li>
<li<b>Bus local:</b> De alta velocidad que conecta el procesador a la
    cach&eacute;, el controlador de la cach&eacute; tambi&eacute;n puede acceder al
    bus del sistema, con esta implementaci&oacute;n, la mayor parte de
    los datos a los que va a acceder el procesador, que est&aacute;n en la
    cach&eacute;, ser&aacute;n entregados a una alta velocidad, otro punto a
    destacar de esta parte es que los accesos a memoria por parte
    de la cach&eacute; no van a interrumpir el flujo de datos entre
    procesador y cach&eacute;. Tambi&eacute;n se ve la posibilidad de
    conectar un dispositivo de entrada salida al bus local.
    Bus del sistema: En el est&aacute; conectada la memoria y por
    debajo el bus de expansi&oacute;n, al cual se pueden conectar una
    amplia diversidad de dispositivos, entre el bus del sistema y
    el bus de expansi&oacute;n se encuentra una interface, que entre las
    principales tareas est&aacute; la de adaptar las velocidades de
    transmisi&oacute;n, por ejemplo para un dispositivo muy lento
    conectado al bus de expansi&oacute;n la interface podr&iacute;a acumular
    una cierta cantidad de datos y luego transmitirla a trav&eacute;s del
    bus del sistema.</li>
    <p> 

    </p>
    <center><img src="img /photo.jpeg" alt=""></center>
    <p>
        
    </p>
    Bus de expansi&oacute;n, m&aacute;s lento conectado mediante otro adaptador.
    Todas las partes del microprocesador est&aacute;n unidas mediante
    diversas l&iacute;neas el&eacute;ctricas. El conjunto de estas l&iacute;neas se
    denominan bus interno del microprocesador. Por este bus
    interno circulan los datos (bus de datos), las se&ntilde;ales de
    control (bus de control) o las direcciones de memoria (bus de
    direcciones). Cuando se habla de un microprocesador de 32
    bits, el n&uacute;mero de l&iacute;neas del bus interno es de 32.

   <b> Bus Externo:</b> Este se utiliza para comunicar el procesador y
   otras partes, como perif&eacute;ricos y memoria.

  <b> Buses ISA (Industry Standard Arquitecture).</b>
   Las primeras computadoras personales estaban equipadas
   con ranuras de 8 bits, que para la velocidad de aquellos
   procesadores eran suficiente. Actualmente son lentas para los
   procesadores que existen.
   Buses EISA(Extended Industry Standard Arquitecture).
   Arquitectura est&aacute;ndar industrial extendida. Tiene
   caracter&iacute;sticas de la ISA en cuanto a su compatibilidad pero
   con la velocidad de MCA es decir, 32 bits.
   Buses VESA(Video Electronic Standard Asociation).
   Son una extensi&oacute;n de ISA. Incluye toda la tecnolog&iacute;a de
   EISA, funcionan al ritmo del procesador y permiten la
   transferencia de datos sin necesidad de que estos intervengan
   permitiendo procesos mucho m&aacute;s r&aacute;pidos y dejando mayor
   tiempo libre al microprocesador central.
   <p>
    <center><img src="img /foto.jpeg" alt=""></center>
   </p>
   <li><b>Buses PCI (Peripheral Component Interconect).</b></li>
   Interconexi&oacute;n a componentes perimetrales. Es de
   caracter&iacute;sticas similares a VESA, pero se distingue porque la
   conexi&oacute;n del bus con el microprocesador se efect&uacute;a por
   intermedio de un chip adicional que simplifica y suprime las
   limitaciones de la conexi&oacute;n directa.
   <li><b>Bus AGP (Advanced Graphics Port).</b></li>
   Puerto Avanzado de Graficos. Se trata de un nuevo sistema
   para conectar perif&eacute;ricos en la placa base de la computadora,
   bus por el que van datos del procesador a los perif&eacute;ricos.
   
   <center><b>CardBus y PC Card (com&uacute;nmente PCMCIA)</b></center>
   <p></p>
   <center><img src="img /tabla1.jpeg" alt=""></center>
   <p> </p>
   <b>Buses multiplexados b&aacute;sicos</b>
En las computadora, el microprocesador controla (y se
comunica con) las memorias y los dispositivos de
entrada/salida (E/S) a trav&eacute;s de la estructura de bus interna.
El bus est&aacute; multiplexado de manera que cualquiera de los
dispositivos que est&aacute;n conectados al mismo pueda enviar o
recibir datos hacia o desde los otros dispositivos.
Se&ntilde;ales del bus. Utilizando la t&eacute;cnica de control sincrono del
bus, el microprocesador suele ser el encargado de generar
todas las se&ntilde;ales de temporizaci&oacute;n y control. Entonces, los
otros dispositivos sincronizan sus operaciones con dichas
se&ntilde;ales de control y temporizaci&oacute;n. Con la t&eacute;cnica de control
as&iacute;ncrono del bus, las se&ntilde;ales de control y temporizaci&oacute;n son
generadas conjuntamente por un origen y destino.
<p></p>
<center><h1>MEMORIA</h1></center>
Es un dispositivo que puede mantenerse en por lo menos dos
estados estables por un cierto periodo de tiempo.
Cada uno de estos estados estables puede utilizarse para
representar un bit.
A un dispositivo con la capacidad de almacenar por lo menos
un bit se le conoce como celda b&aacute;sica de memoria.
Un dispositivo de memoria completo se forma con varias
celdas b&aacute;sicas y los circuitos asociados para poder leer y
escribir dichas celdas b&aacute;sicas, agrupadas como localidades
de memoria que permitan almacenar un grupo de N bits.
<center><img src="img /image.jpeg" alt=""></center>
El numero de bits que puede almacenar cada localidad de
memoria es conocido como el ancho de palabra de la
memoria. Coincide con el ancho del bus de datos.
Uno de los circuitos auxiliares que integran la memoria es el
decodificador de direcciones. Su funci&eacute;n es la de activar a
las celdas basicas que van a ser leidas o escritas a partir de la
direcci&oacute;n presente en el bus de direcciones. Tiene como
entradas las N lineas del bus de direcciones y 2N lineas de
habilitaci&oacute;n de localidad, cada una correspondiente a una
combinación binaria distinta de los bits de direcciones.
Por lo tanto, el numero de localidades de memoria
disponibles en un dispositivo (T) se relaciona con el numero
de lineas de direccion N por T= 2N.
Conceptos basicos del manejo de la memoria.
Se produce bajo el control directo y continuo del programa
que solicita la operaci&eacute;n de E/S. tanto en la entrada y salida
programada como con interrupciones, el procesador es
responsable de extraer los datos de la memoria en una salida,
y almacenar los datos en la memoria principal. El problema
con la E/S es que el procesador tiene que esperar un tiempo
considerable hasta que el modulo en cuesti&oacute;n este preparado
para recibir o transmitir datos.

><li><b>Memoria principal Semiconductora.</b></li>

La memoria del semiconductor utiliza en su arquitectura
circuitos integrados basados en semiconductores para
almacenar informaci&oacute;n.
Un chip de memoria de semiconductor puede contener
millones de minusculos transistores o condensadores.
Existen memorias de semiconductor de ambos
tipos: volatiles y no volatiles.
En las computadoras modernas, la memoria principal
consiste casi exclusivamente en memoria de semiconductor
volatil y dinamica, tambien conocida como memoria
dinamica de acceso aleatorio o más comúnmente RAM
(Random Access Memory).
<center><img src="img /primera.jpeg" alt=""></center>

Con el cambio de siglo, ha habido un crecimiento constante
en el uso de un nuevo tipo de memoria de semiconductor no
volatil llamado memoria flash.
Dicho crecimiento se ha dado, principalmente en el campo
de las memorias fuera de linea en computadoras
principalmente de escritorio.
Las memorias de semiconductor no volatiles se estan usando
tambien como memorias secundarias en varios dispositivos
de electr&oacute;nica avanzada y computadoras especializadas y no
especializadas.

<b>Memoria Cach&eacute;.</b>

Dentro de nuestro procesador no solo se encuentran los
componentes que hacen posible sus enormes capacidades de
computaci&oacute;n, tambien hay una peque&ntilde;a memoria que se
encarga de conseguir que el trabajo de nuestro
procesador pueda realizarse a la velocidad que este opera.
Es la memoria de acceso rapido de una computadora, que
guarda temporalmente las ultimas informaciones procesadas.
La memoria cach&eacute; es un bufer especial de memoria que
poseen las computadoras, que funciona de manera similar a
la memoria principal, pero es de menor tama&ntilde;o y de acceso
mas rapido. Es usada por el procesador para reducir el
tiempo de acceso a datos ubicados en la memoria principal
que se utilizan con más frecuencia.
La cach&eacute; es una memoria que se situa entre la unidad central
de procesamiento (CPU) y la memoria de acceso
aleatorio (RAM) para acelerar el intercambio de datos.
Cuando se accede por primera vez a un dato, se hace una
copia en la cach&eacute;; los accesos siguientes se realizan a dicha
copia, haciendo que sea menor el tiempo de acceso medio al
dato.
Cuando el procesador necesita leer o escribir en una
ubicaci&oacute;n en memoria principal, primero verifica si una
copia de los datos esta en la memoria cache; si es asi, el
procesador de inmediato lee o escribe en la memoria cache,
que es mucho mas rapido que de la lectura o la escritura a la
memoria principal.
<center><img src="img /segunda.jpeg" alt=""></center>

<center><b>Memoria cache nivel 1 (L1).</b></center>

Tambien llamada memoria interna, se encuentra en el nucleo
del procesador. Es utilizada para almacenar y acceder a datos
e instrucciones importantes y de uso frecuente, agilizando
los procesos al ser el nivel que ofrece un tiempo de respuesta
menor. Se divide en dos subniveles:
<li><b>Nivel 1 Data cache:</b> se encarga de almacenar datos usados
    frecuentemente.</li>

<li><b>1 Instruction cache:</b> se encarga de almacenar
    instrucciones usadas frecuentemente.</li> 

<center><b>Memoria cache nivel 2 (L2).</b></center>
Se encarga de almacenar datos de uso frecuente, es mayor
que la cach&eacute; L1, pero a costa de ser mas lenta, aun asi es mas
r&aacute;pida que la memoria principal (RAM).
Puede ser inclusiva y contener una copia del nivel 1 ademas
de informaci&oacute;n extra, o exclusiva y que su contenido sea
totalmente diferente de la cache L1, proporcionando asi
mayor capacidad total.
<center><img src="img /tercera.jpeg" alt=""></center>

<center><b>Memoria cache nivel 3 (L3).</b></center>
Es mas rapida que la memoria principal (RAM), pero mas
lenta que L2, ayuda a que el sistema guarde gran cantidad de
informaci&oacute;n agilizando las tareas del procesador.
En esta memoria se agiliza el acceso a datos e instrucciones
que no fueron localizadas en L1 o L2.
Al igual que la L2, puede ser inclusiva y contener una copia
de L2 ademas de informaci&oacute;n extra o, por el contrario, ser
exclusiva y contener informaci&oacute;n totalmente diferente a la de
los niveles anteriores, consiguiendo asi una mayor capacidad
total.    
</html>